tap 'homebrew/cask'

cask_args appdir: '~/Applications', require_sha: true

cask '1password'
cask 'alacritty'
cask 'amethyst'
cask 'authy'
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'goland'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'logseq'
cask 'rubymine'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'
cask 'session-manager-plugin'

tap 'homebrew/cask-fonts'

cask 'font-jetbrains-mono-nerd-font'

brew 'awscli'
brew 'bat'
brew 'chezmoi'
brew 'chruby'
brew 'chruby-fish'
brew 'delta'
brew 'direnv'
brew 'fd'
brew 'fish'
brew 'fluxcd/tap/flux'
brew 'fzf'
brew 'git'
brew 'go'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'k6'
brew 'k9s'
brew 'mkcert'
brew 'mysql'
brew 'neovim'
brew 'node@16'
brew 'openssl'
brew 'rg'
brew 'ruby-install'
brew 'shared-mime-info'
brew 'starship'
brew 'terraform'
brew 'tig'
brew 'tmux'
brew 'watchman'
brew 'zstd'
