tap "homebrew/cask"

cask_args appdir: "~/Applications", require_sha: true

cask "1password"
cask "alacritty"
cask "amethyst"
cask "authy"
cask "brave-browser"
cask "discord"
cask "docker"
cask "goland"
cask "google-chrome"
cask "hammerspoon"
cask "iterm2"
cask "karabiner-elements"
cask "logseq"
cask "rubymine"
cask "slack"
cask "spotify"
cask "telegram"
cask "vlc"
cask "whatsapp"
cask "zoom"

tap "homebrew/cask-fonts"

cask "font-jetbrains-mono-nerd-font"

brew "bat"
brew "chezmoi"
brew "chruby"
brew "chruby-fish"
brew "delta"
brew "direnv"
brew "fd"
brew "fish"
brew "fzf"
brew "git"
brew "htop"
brew "mkcert"
brew "mysql" 
brew "neovim"
brew "openssl"
brew "rg"
brew "ruby-install"
brew "shared-mime-info"
brew "starship"
brew "tig"
brew "tmux"
brew "watchman"
brew "zstd"
