cask_args appdir: '~/Applications', require_sha: false

cask 'alacritty'
cask 'authy'
cask 'brave-browser'
cask 'calibre'
cask 'confluent-cli'
cask 'discord'
cask 'docker'
cask 'expressvpn'
cask 'goland'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keeper-password-manager'
cask 'logseq'
cask 'rectangle'
cask 'rubymine'
cask 'sequential'
cask 'session-manager-plugin'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'vlc'
cask 'whatsapp'
cask 'zoom'

tap 'homebrew/cask-fonts'

cask 'font-jetbrains-mono-nerd-font'

brew 'argocd'
brew 'asdf'
brew 'awscli'
brew 'bat'
brew 'chezmoi'
brew 'clusterctl'
brew 'delta'
brew 'direnv'
brew 'fd'
brew 'fish'
brew 'fluxcd/tap/flux'
brew 'fzf'
brew 'git'
brew 'go'
brew 'helm'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'k6'
brew 'k9s'
brew 'kcat'
brew 'kind'
brew 'kubeconform'
brew 'mkcert'
brew 'mysql-client@8.0'
brew 'neovim'
brew 'openssl@3'
brew 'rg'
brew 'ruby-install'
brew 'semgrep'
brew 'shared-mime-info'
brew 'starship'
brew 'terraform'
brew 'terraform-ls'
brew 'tig'
brew 'tmux'
brew 'watchman'
brew 'ykman'
brew 'zstd'
brew 'node@20'
